# Perguntas do CEO (Aula 01)

In [1]:
import pandas as pd

data = pd.read_csv('datasets/kc_house_data.csv')

data.head()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,7129300520,20141013T000000,221900.0,3,1.00,1180,5650,1.0,0,0,...,7,1180,0,1955,0,98178,47.5112,-122.257,1340,5650
1,6414100192,20141209T000000,538000.0,3,2.25,2570,7242,2.0,0,0,...,7,2170,400,1951,1991,98125,47.7210,-122.319,1690,7639
2,5631500400,20150225T000000,180000.0,2,1.00,770,10000,1.0,0,0,...,6,770,0,1933,0,98028,47.7379,-122.233,2720,8062
3,2487200875,20141209T000000,604000.0,4,3.00,1960,5000,1.0,0,0,...,7,1050,910,1965,0,98136,47.5208,-122.393,1360,5000
4,1954400510,20150218T000000,510000.0,3,2.00,1680,8080,1.0,0,0,...,8,1680,0,1987,0,98074,47.6168,-122.045,1800,7503

In [2]:
#1. Quantas casas estão disponíveis para compra?
data.shape[0]

21613

In [3]:
#2. Quantos atributos as casas possuem?
data.shape[1]

21

In [4]:
#3. Quais são os atributos das casas?
data.columns

Index(['id', 'date', 'price', 'bedrooms', 'bathrooms', 'sqft_living',
       'sqft_lot', 'floors', 'waterfront', 'view', 'condition', 'grade',
       'sqft_above', 'sqft_basement', 'yr_built', 'yr_renovated', 'zipcode',
       'lat', 'long', 'sqft_living15', 'sqft_lot15'],
      dtype='object')

In [5]:
#4. Qual a casa mais cara ( casa com o maior valor de venda )?
data[['id', 'price']].sort_values('price', ascending=False)

               id      price
7252   6762700020  7700000.0
3914   9808700762  7062500.0
9254   9208900037  6885000.0
4411   2470100110  5570000.0
1448   8907500070  5350000.0
...           ...        ...
8274   3883800011    82000.0
16198  3028200080    81000.0
465    8658300340    80000.0
15293    40000362    78000.0
1149   3421079032    75000.0

[21613 rows x 2 columns]

In [7]:
#5. Qual a casa com o maior número de quartos?
data[['id', 'bedrooms']].sort_values('bedrooms', ascending=False)

               id  bedrooms
15870  2402100895        33
8757   1773100755        11
15161  5566100170        10
13314   627300145        10
19254  8812401450        10
...           ...       ...
19452  3980300371         0
8484   2310060040         0
875    6306400140         0
8477   2569500210         0
9773   3374500520         0

[21613 rows x 2 columns]

In [8]:
#6. Qual a soma total de quartos do conjunto de dados?
data['bedrooms'].sum()

72854

In [9]:
#7. Quantas casas possuem 2 banheiros?
data[data['bathrooms']==2].shape

(1930, 21)

In [10]:
#8. Qual o preço médio de todas as casas no conjunto de dados?
data['price'].mean()

540088.1417665294

In [11]:
#9. Qual o preço médio de casas com 2 banheiros?
data.loc[data['bathrooms']==2,'price'].mean()

457889.7186528497

In [12]:
#10. Qual o preço mínimo entre as casas com 3 quartos?
data.loc[data['bedrooms']==3, 'price'].min()

82000.0

In [14]:
#11. Quantas casas possuem mais de 300 metros quadrados
##na sala de estar?
data['m2_living'] = data['sqft_living']*0.092
data[data['m2_living']>300].shape

(2141, 23)

In [15]:
#12. Quantas casas tem mais de 2 andares?
data[data['floors']>2].shape

(782, 23)

In [16]:
#13. Quantas casas tem vista para o mar?
data[data['waterfront']==1].shape

(163, 23)

In [18]:
#14. Das casas com vista para o mar, quantas tem 3 quartos?
data[(data['waterfront']==1) & (data['bedrooms']==3)].shape

(64, 23)

In [19]:
#15. Das casas com mais de 300 metros quadrados de sala de estar,
##quantas tem mais de 2 banheiros?
data[(data['m2_living']>300) & (data['bathrooms']>2)].shape

(2088, 23)